lelebrr/Esp32-S3/src/main.cpp
#include "core/main_menu.h"
#include "core/optimization_manager.h"
#include "core/system/PanicMode.h"
#include "core/persistence.h"
#include "core/stealth.h"
#include <globals.h>
#include <Preferences.h>

#include "core/powerSave.h"
#include "core/serial_commands/cli.h"
#include "core/utils.h"
#include "esp32-hal-psram.h"
#include "esp_task_wdt.h"
#include <functional>
#include <string>
#include <vector>

// Novos módulos otimizados
#include "modules/ble/ble_spam_br.h"
#include "modules/wifi/wifi_deauth_pmkid.h"
#include "nfc_fault_mosfet.h"
#include "q_learn_ia.h"

io_expander ioExpander;
LeleConfig leleConfig;
LeleConfigPins leleConfigPins;

SerialCli serialCli;
USBSerial USBserial;
SerialDevice *serialDevice = &USBserial;

Preferences preferences;
enum PowerMode { ECONOMY = 0, BALANCED = 1, FORCE = 2 };
PowerMode currentPowerMode = BALANCED;

StartupApp startupApp;
MainMenu mainMenu;
SPIClass sdcardSPI;
#ifdef USE_HSPI_PORT
SPIClass CC_NRF_SPI(VSPI);
#else
SPIClass CC_NRF_SPI(HSPI);
#endif

// Navigation Variables
volatile bool NextPress = false;
volatile bool PrevPress = false;
volatile bool UpPress = false;
volatile bool DownPress = false;
volatile bool SelPress = false;
volatile bool EscPress = false;
volatile bool AnyKeyPress = false;
volatile bool NextPagePress = false;
volatile bool PrevPagePress = false;
volatile bool LongPress = false;
volatile bool SerialCmdPress = false;
volatile int forceMenuOption = -1;
volatile uint8_t menuOptionType = 0;
String menuOptionLabel = "";
#ifdef HAS_ENCODER_LED
volatile int EncoderLedChange = 0;
#endif

TouchPoint touchPoint;

keyStroke KeyStroke;

TaskHandle_t xHandle;
void __attribute__((weak)) taskInputHandler(void *parameter) {
    auto timer = millis();
    while (true) {
        checkPowerSaveTime();
        // Sometimes this task run 2 or more times before looptask,
        // and navigation gets stuck, the idea here is run the input detection
        // if AnyKeyPress is false, or rerun if it was not renewed within 75ms (arbitrary)
        // because AnyKeyPress will be true if didn´t passed through a check(bool var)
        if (!AnyKeyPress || millis() - timer > 75) {
            NextPress = false;
            PrevPress = false;
            UpPress = false;
            DownPress = false;
            SelPress = false;
            EscPress = false;
            AnyKeyPress = false;
            SerialCmdPress = false;
            NextPagePress = false;
            PrevPagePress = false;
            touchPoint.pressed = false;
            touchPoint.Clear();
#ifndef USE_TFT_eSPI_TOUCH
            InputHandler();
#endif
            timer = millis();
        }

        // Manual deep sleep trigger (5s hold SEL button)
        static bool longSel = false;
        static unsigned long selPressTime = 0;
        if (SelPress && !longSel) {
            longSel = true;
            selPressTime = millis();
        } else if (longSel && millis() - selPressTime > 5000) {
            esp_sleep_enable_timer_wakeup(60000 * 1000);
            esp_deep_sleep_start();
        } else if (!SelPress) {
            longSel = false;
        }

        // Verificar switches e atualizar estados
        read_switches();
        update_leds();
        check_fault_injection();

        // IA toma decisões periodicamente
        static unsigned long last_ai_check = 0;
        if (millis() - last_ai_check > 5000) {  // A cada 5 segundos
            ai_attack_decision();
            save_q_table_to_sd();  // Salvar progresso
            last_ai_check = millis();
        }

        // Deep sleep condicional
        conditional_deep_sleep();

        vTaskDelay(pdMS_TO_TICKS(10));
    }
}
// Public Globals Variables
unsigned long previousMillis = millis();
int prog_handler; // 0 - Flash, 1 - LittleFS, 3 - Download
String cachedPassword = "";
bool interpreter_start = false;
bool sdcardMounted = false;
bool gpsConnected = false;

// Novos pinos para LEDs, switches e fault injection
#define LED_ATTACK_RED_HIGH 4      // GPIO4: LED alto brilho vermelho (ataque/falha)
#define LED_ATTACK_RED_LOW 0       // GPIO0: LED baixo brilho vermelho (pronto)
#define LED_AI_BLUE 6              // GPIO6: LED alto brilho azul (IA/dormindo)
#define LED_SLEEP_BLUE 7           // GPIO7: LED alto brilho azul (IA/dormindo)
#define SWITCH_STEALTH_UART2 15    // GPIO15: interruptor preto (desliga UART2)
#define SWITCH_STEALTH_UART1 16    // GPIO16: interruptor preto (desliga UART1)
#define SWITCH_ATTACK_CC1101 14    // GPIO14: interruptor vermelho (liga CC1101)
#define SWITCH_ATTACK_PN532 17     // GPIO17: interruptor vermelho (liga PN532)
#define SWITCH_AI_PAJ7620 18       // GPIO18: interruptor verde (liga PAJ7620U2)
#define SWITCH_AI_DS3231 19        // GPIO19: interruptor verde (liga DS3231)
#define FAULT_INJECT_BUTTON 33     // GPIO33: push button curto (fault injection)
#define POWER_SWITCH 99            // VCC bateria → BMS (não GPIO, controle de energia)

// Estados dos switches e LEDs
bool stealth_mode = false;
bool attack_mode = false;
bool ai_mode = false;
bool fault_injection_active = false;
bool ready_led_state = false;
bool attack_led_state = false;
bool ai_led_state = false;

// Q-table para IA local (armazenada em PSRAM)
float* q_table = nullptr;
const int Q_TABLE_SIZE = 2048;  // 2KB Q-table

// wifi globals - organizados em namespace para melhor encapsulamento
// wifi globals
bool wifiConnected = false;
bool isWebUIActive = false;
String wifiIP;

bool BLEConnected = false;
bool returnToMenu;
bool isSleeping = false;
bool isScreenOff = false;
bool dimmer = false;
char timeStr[10];
time_t localTime;
struct tm *timeInfo;
#if defined(HAS_RTC)
cplus_RTC _rtc;
RTC_TimeTypeDef _time;
RTC_DateTypeDef _date;
bool clock_set = true;
#else
ESP32Time rtc;
bool clock_set = false;
#endif

std::vector<Option> options;
// Protected global variables
#if defined(HAS_SCREEN)
tft_logger tft = tft_logger(); // Invoke custom library
TFT_eSprite sprite = TFT_eSprite(&tft);
TFT_eSprite draw = TFT_eSprite(&tft);
volatile int tftWidth = TFT_HEIGHT;
#ifdef HAS_TOUCH
volatile int tftHeight =
    TFT_WIDTH - 20; // 20px to draw the TouchFooter(), were the btns are being read in touch devices.
#else
volatile int tftHeight = TFT_WIDTH;
#endif
#else
tft_logger tft;
SerialDisplayClass &sprite = tft;
SerialDisplayClass &draw = tft;
volatile int tftWidth = VECTOR_DISPLAY_DEFAULT_HEIGHT;
volatile int tftHeight = VECTOR_DISPLAY_DEFAULT_WIDTH;
#endif

#include "core/boot_hw_scan.h" // for boot_screen_hw
#include "core/display.h"
#include "core/led_control.h"
#include "core/mykeyboard.h"
#include "core/sd_functions.h"
#include "core/serialcmds.h"
#include "core/settings.h"
#include "core/wifi/webInterface.h"
#include "core/wifi/wifi_common.h"
#include "modules/bjs_interpreter/interpreter.h" // for JavaScript interpreter
#include "modules/others/audio.h"                // for playAudioFile
#include "modules/rf/rf_utils.h"                 // for initCC1101once
#include <Wire.h>
#include <driver/uart.h>

void showBootMenu() {
    tft.fillScreen(TFT_BLACK);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextSize(2);
    tft.drawCentreString("Power Mode Selection", tftWidth / 2, 10, 2);
    tft.setTextSize(1);
    tft.drawCentreString("Press GPIO0 to enter, timeout 3s", tftWidth / 2, 40, 1);
    pinMode(0, INPUT_PULLUP);
    unsigned long start = millis();
    while (millis() - start < 3000) {
        if (digitalRead(0) == LOW) {
            selectMode();
            return;
        }
        delay(10);
    }
    tft.drawCentreString("Using saved mode", tftWidth / 2, 60, 1);
    delay(1000);
}

