lelebrr/Esp32-S3/src/main.cpp
void selectMode() {
    tft.fillScreen(TFT_BLACK);
    tft.setTextSize(2);
    tft.drawCentreString("Select Mode:", tftWidth / 2, 10, 2);
    tft.setTextSize(1);
    tft.drawCentreString("1: Economy (14 days)", tftWidth / 2, 40, 1);
    tft.drawCentreString("2: Balanced (5 days)", tftWidth / 2, 60, 1);
    tft.drawCentreString("3: Force (8h)", tftWidth / 2, 80, 1);
    tft.drawCentreString("Warning: Force drains battery fast", tftWidth / 2, 100, 1);
    tft.drawCentreString("Use buttons to select", tftWidth / 2, 120, 1);
    pinMode(leleConfigPins.SEL, INPUT_PULLUP);
    pinMode(leleConfigPins.ESC, INPUT_PULLUP);
    pinMode(leleConfigPins.NEXT, INPUT_PULLUP);
    pinMode(leleConfigPins.PREV, INPUT_PULLUP);
    int selected = currentPowerMode + 1;
    while (true) {
        tft.fillRect(0, 140, tftWidth, 20, TFT_BLACK);
        tft.drawCentreString("Selected: " + String(selected), tftWidth / 2, 140, 1);
        if (digitalRead(leleConfigPins.SEL) == LOW) {
            currentPowerMode = (PowerMode)(selected - 1);
            preferences.putUChar("bat_mode", currentPowerMode);
            tft.drawCentreString("Saved!", tftWidth / 2, 160, 1);
            delay(500);
            applyPowerMode();
            return;
        }
        if (digitalRead(leleConfigPins.ESC) == LOW) {
            tft.drawCentreString("Cancelled", tftWidth / 2, 160, 1);
            delay(500);
            return;
        }
        if (digitalRead(leleConfigPins.NEXT) == LOW) {
            selected = selected % 3 + 1;
            delay(200);
        }
        if (digitalRead(leleConfigPins.PREV) == LOW) {
            selected = selected == 1 ? 3 : selected - 1;
            delay(200);
        }
        delay(10);
    }
}

void applyPowerMode() {
    OptimizationMode mode;
    switch (currentPowerMode) {
        case ECONOMY:
            mode = MODE_POWERSAVE;
            break;
        case BALANCED:
            mode = MODE_BALANCED;
            break;
        case FORCE:
            mode = MODE_PERFORMANCE;
            break;
    }
    optimizationManager.setMode(mode);
}

/*********************************************************************
 **  Function: begin_storage
 **  Config LittleFS and SD storage
 *********************************************************************/
void begin_storage() {
    if (!LittleFS.begin(true)) { LittleFS.format(), LittleFS.begin(); }
    bool checkFS = setupSdCard();
    leleConfig.fromFile(checkFS);
    leleConfigPins.fromFile(checkFS);
}

/*********************************************************************
 **  Function: _setup_gpio()
 **  Sets up a weak (empty) function to be replaced by /ports/* /interface.h
 *********************************************************************/
void _setup_gpio() __attribute__((weak));
void _setup_gpio() {}

/*********************************************************************
 **  Function: _post_setup_gpio()
 **  Sets up a weak (empty) function to be replaced by /ports/* /interface.h
 *********************************************************************/
void _post_setup_gpio() __attribute__((weak));
void _post_setup_gpio() {}

/*********************************************************************
 **  Function: setup_gpio
 **  Setup GPIO pins
 *********************************************************************/
void setup_gpio() {

    // init setup from /ports/*/interface.h
    _setup_gpio();

    // Smoochiee v2 uses a AW9325 tro control GPS, MIC, Vibro and CC1101 RX/TX powerlines
    ioExpander.init(IO_EXPANDER_ADDRESS, &Wire);

#if TFT_MOSI > 0
    if (leleConfigPins.CC1101_bus.mosi == (gpio_num_t)TFT_MOSI)
        initCC1101once(&tft.getSPIinstance()); // (T_EMBED), CORE2 and others
    else
#endif
        if (leleConfigPins.CC1101_bus.mosi == leleConfigPins.SDCARD_bus.mosi)
        initCC1101once(&sdcardSPI); // (ARDUINO_M5STACK_CARDPUTER) and (ESP32S3DEVKITC1) and devices that
                                    // share CC1101 pin with only SDCard
    else initCC1101once(NULL);
    // (ARDUINO_M5STICK_C_PLUS) || (ARDUINO_M5STICK_C_PLUS2) and others that doesn´t share SPI with
    // other devices (need to change it when Lele board comes to shore)
}

/*********************************************************************
 **  Function: begin_tft
 **  Config tft
 *********************************************************************/
void begin_tft() {
    tft.setRotation(leleConfig.rotation); // sometimes it misses the first command
    tft.invertDisplay(leleConfig.colorInverted);
    tft.setRotation(leleConfig.rotation);
    tftWidth = tft.width();
#ifdef HAS_TOUCH
    tftHeight = tft.height() - 20;
#else
    tftHeight = tft.height();
#endif
    resetTftDisplay();
    setBrightness(leleConfig.bright, false);
}

/*********************************************************************
 **  Function: boot_screen
 **  Draw boot screen
 *********************************************************************/
void boot_screen() {
    tft.setTextColor(leleConfig.priColor, leleConfig.bgColor);
    tft.setTextSize(FM);
    tft.drawPixel(0, 0, leleConfig.bgColor);
    tft.drawCentreString("LELE", tftWidth / 2, 10, 1);
    tft.setTextSize(FP);
    tft.drawCentreString(LELE_VERSION, tftWidth / 2, 25, 1);
    tft.setTextSize(FM);
    tft.drawCentreString(
        "PREDATORY FIRMWARE", tftWidth / 2, tftHeight + 2, 1
    ); // will draw outside the screen on non touch devices
}

/*********************************************************************
 **  Function: boot_screen_anim
 **  Draw boot screen
 *********************************************************************/
void boot_screen_anim() {
    boot_screen();
    int i = millis();
    // checks for boot.jpg in SD and LittleFS for customization
    int boot_img = 0;
    bool drawn = false;
    if (sdcardMounted) {
        if (SD.exists("/boot.jpg")) boot_img = 1;
        else if (SD.exists("/boot.gif")) boot_img = 3;
    }
    if (boot_img == 0 && LittleFS.exists("/boot.jpg")) boot_img = 2;
    else if (boot_img == 0 && LittleFS.exists("/boot.gif")) boot_img = 4;
    if (leleConfig.theme.boot_img) boot_img = 5; // override others

    tft.drawPixel(0, 0, 0);       // Forces back communication with TFT, to avoid ghosting
                                  // Start image loop
    while (millis() < i + 7000) { // boot image lasts for 5 secs
        if ((millis() - i > 2000) && !drawn) {
            tft.fillRect(0, 45, tftWidth, tftHeight - 45, leleConfig.bgColor);
            if (boot_img > 0 && !drawn) {
                tft.fillScreen(leleConfig.bgColor);
                if (boot_img == 5) {
                    drawImg(
                        *leleConfig.themeFS(),
                        leleConfig.getThemeItemImg(leleConfig.theme.paths.boot_img),
                        0,
                        0,
                        true,
                        3600
                    );
                    Serial.println("Image from SD theme");
                } else if (boot_img == 1) {
                    drawImg(SD, "/boot.jpg", 0, 0, true);
                    Serial.println("Image from SD");
                } else if (boot_img == 2) {
                    drawImg(LittleFS, "/boot.jpg", 0, 0, true);
                    Serial.println("Image from LittleFS");
                } else if (boot_img == 3) {
                    drawImg(SD, "/boot.gif", 0, 0, true, 3600);
                    Serial.println("Image from SD");
                } else if (boot_img == 4) {
                    drawImg(LittleFS, "/boot.gif", 0, 0, true, 3600);
                    Serial.println("Image from LittleFS");
                }
                tft.drawPixel(0, 0, 0); // Forces back communication with TFT, to avoid ghosting
            }
            drawn = true;
        }
#if !defined(LITE_VERSION)
        if (!boot_img && (millis() - i > 2200) && (millis() - i) < 2700)
            tft.drawRect(2 * tftWidth / 3, tftHeight / 2, 2, 2, leleConfig.priColor);
        if (!boot_img && (millis() - i > 2700) && (millis() - i) < 2900)
            tft.fillRect(0, 45, tftWidth, tftHeight - 45, leleConfig.bgColor);
        if (!boot_img && (millis() - i > 2900) && (millis() - i) < 3400)
            tft.drawXBitmap(
                2 * tftWidth / 3 - 30,
                5 + tftHeight / 2,
                Lele_small_bits,
                Lele_small_width,
                Lele_small_height,
                leleConfig.bgColor,
                leleConfig.priColor
            );
        if (!boot_img && (millis() - i > 3400) && (millis() - i) < 3600) tft.fillScreen(leleConfig.bgColor);
        if (!boot_img && (millis() - i > 3600))
            tft.drawXBitmap(
                (tftWidth - 238) / 2,
                (tftHeight - 133) / 2,
                bits,
                bits_width,
                bits_height,
                leleConfig.bgColor,
                leleConfig.priColor
            );
#endif
        if (check(AnyKeyPress)) // If any key or M5 key is pressed, it'll jump the boot screen
        {
            tft.fillScreen(leleConfig.bgColor);
            delay(10);
            return;
        }
    }

    // Clear splashscreen
    tft.fillScreen(leleConfig.bgColor);
}

/*********************************************************************
 **  Function: init_clock
 **  Clock initialisation for propper display in menu
 *********************************************************************/
void init_clock() {
#if defined(HAS_RTC)

    _rtc.begin();
    _rtc.GetBm8563Time();
    _rtc.GetTime(&_time);
#endif
}

/*********************************************************************
 **  Function: init_led
 **  Led initialisation
 *********************************************************************/
void init_led() {
#ifdef HAS_RGB_LED
    beginLed();
#endif
}

/*********************************************************************
 **  Function: startup_sound
 **  Play sound or tone depending on device hardware
 *********************************************************************/
void startup_sound() {
    if (leleConfig.soundEnabled == 0) return; // if sound is disabled, do not play sound
#if !defined(LITE_VERSION)
#if defined(BUZZ_PIN)
    // Bip M5 just because it can. Does not bip if splashscreen is bypassed
    _tone(5000, 50);
    delay(200);
    _tone(5000, 50);
    /*  2fix: menu infinite loop */
#elif defined(HAS_NS4168_SPKR)
    // play a boot sound
    if (leleConfig.theme.boot_sound) {
        playAudioFile(leleConfig.themeFS(), leleConfig.getThemeItemImg(leleConfig.theme.paths.boot_sound));
    } else if (SD.exists("/boot.wav")) {
        playAudioFile(&SD, "/boot.wav");
    } else if (LittleFS.exists("/boot.wav")) {
        playAudioFile(&LittleFS, "/boot.wav");
    }
#endif
#endif
}

