lelebrr/Esp32-S3/src/main.cpp
// #include "core/aggressive_sd.h" // Removed
#include "core/secure_boot.h"

// ESP32-S3 Optimization Modules
#ifdef CYD_S3
#include "core/thermal_manager.h"
#include "core/power_gating.h"
#include "core/gesture_wake.h"
#include "hardware/s3_hardware_init.h"
#include "core/s3_performance.h"
#include "core/audio_dma.h"
#include "core/paj7620u2.h"
#include "core/ai_attack_learner.h"
#endif

// Funções para novos componentes de hardware
void init_new_hardware_pins() {
    // Configurar LEDs como saída
    pinMode(LED_ATTACK_RED_HIGH, OUTPUT);
    pinMode(LED_ATTACK_RED_LOW, OUTPUT);
    pinMode(LED_AI_BLUE, OUTPUT);
    pinMode(LED_SLEEP_BLUE, OUTPUT);

    // Configurar switches como entrada com pull-up
    pinMode(SWITCH_STEALTH_UART2, INPUT_PULLUP);
    pinMode(SWITCH_STEALTH_UART1, INPUT_PULLUP);
    pinMode(SWITCH_ATTACK_CC1101, INPUT_PULLUP);
    pinMode(SWITCH_ATTACK_PN532, INPUT_PULLUP);
    pinMode(SWITCH_AI_PAJ7620, INPUT_PULLUP);
    pinMode(SWITCH_AI_DS3231, INPUT_PULLUP);

    // Configurar push button como entrada com pull-up
    pinMode(FAULT_INJECT_BUTTON, INPUT_PULLUP);

    // Inicializar LEDs apagados
    digitalWrite(LED_ATTACK_RED_HIGH, LOW);
    digitalWrite(LED_ATTACK_RED_LOW, LOW);
    digitalWrite(LED_AI_BLUE, LOW);
    digitalWrite(LED_SLEEP_BLUE, LOW);

    log_i("[HW] Novos pinos de hardware inicializados");
}

void read_switches() {
    // Ler estado dos switches (LOW = ligado)
    stealth_mode = (digitalRead(SWITCH_STEALTH_UART2) == LOW) || (digitalRead(SWITCH_STEALTH_UART1) == LOW);
    attack_mode = (digitalRead(SWITCH_ATTACK_CC1101) == LOW) || (digitalRead(SWITCH_ATTACK_PN532) == LOW);
    ai_mode = (digitalRead(SWITCH_AI_PAJ7620) == LOW) || (digitalRead(SWITCH_AI_DS3231) == LOW);
}

void update_leds() {
    // LED vermelho baixo brilho: sempre ligado quando pronto
    ready_led_state = !isSleeping && !fault_injection_active;
    digitalWrite(LED_ATTACK_RED_LOW, ready_led_state ? HIGH : LOW);

    // LEDs vermelhos alto brilho: piscam durante ataque
    attack_led_state = attack_running || fault_injection_active;
    digitalWrite(LED_ATTACK_RED_HIGH, attack_led_state ? HIGH : LOW);

    // LEDs azuis: IA ativa ou dormindo
    ai_led_state = ai_mode && !attack_running;
    digitalWrite(LED_AI_BLUE, ai_led_state ? HIGH : LOW);
    digitalWrite(LED_SLEEP_BLUE, isSleeping ? HIGH : LOW);
}

void check_fault_injection() {
    static unsigned long last_fault_time = 0;
    if (digitalRead(FAULT_INJECT_BUTTON) == LOW && millis() - last_fault_time > 1000) {
        last_fault_time = millis();
        fault_injection_active = true;

        // Pulso de 5ms no MOSFET IRF520 para PN532
        digitalWrite(42, HIGH);  // GPIO42 controla MOSFET
        delay(5);
        digitalWrite(42, LOW);

        log_w("[FAULT] Injeção de falha manual ativada");
        delay(100);
        fault_injection_active = false;
    }
}

    // Funções Q-table movidas para q_learn_ia.cpp

void ai_attack_decision() {
    // Usar nova implementação Q-learning otimizada
    if (!is_q_learning_active()) {
        start_q_learning();
    }
}

void conditional_deep_sleep() {
    if (!attack_running && !speech_pending && millis() - last_speech_time > 500) {
        log_i("[SLEEP] Entrando em deep sleep por 500ms");
        esp_sleep_enable_timer_wakeup(500 * 1000);  // 500ms
        esp_deep_sleep_start();
    }
}

void tts_async_task(void *parameter) {
    while (true) {
        if (speech_pending) {
            // TTS usa buffer em PSRAM
            speak_buffered_text();
            speech_pending = false;
            last_speech_time = millis();
        }
        vTaskDelay(pdMS_TO_TICKS(100));
    }
}

void think_and_speak(const char* text) {
    if (speech_pending) return;  // Já há fala pendente

    // Bufferizar texto em PSRAM para TTS assíncrono
    speech_pending = true;
    log_i("[TTS] Fala agendada: %s", text);
}

/*********************************************************************
 **  Function: setup
 **  Where the devices are started and variables set
 *********************************************************************/
void setup() {
    aggressive_boot_logic(); // Replaced by SecureBoot
    SecureBoot::run();

    Serial.setRxBufferSize(
        SAFE_STACK_BUFFER_SIZE / 4
    ); // Must be invoked before Serial.begin(). Default is 256 chars
    Serial.begin(115200);
    uart_set_baudrate(UART_NUM_1, 38400);

    log_d("Total heap: %d", ESP.getHeapSize());
    log_d("Free heap: %d", ESP.getFreeHeap());
    if (psramInit()) log_d("PSRAM Started");
    if (psramFound()) log_d("PSRAM Found");
    else log_d("PSRAM Not Found");
    log_d("Total PSRAM: %d", ESP.getPsramSize());
    log_d("Free PSRAM: %d", ESP.getFreePsram());

    // declare variables
    prog_handler = 0;
    sdcardMounted = false;
    wifiConnected = false;
    BLEConnected = false;
    leleConfig.bright = 100; // theres is no value yet
    leleConfig.rotation = ROTATION;
    setup_gpio();
#if defined(HAS_SCREEN)
    tft.init();
    tft.setRotation(leleConfig.rotation);
    tft.fillScreen(TFT_BLACK);
    // leleConfig is not read yet.. just to show something on screen due to long boot time
    tft.setTextColor(TFT_PURPLE, TFT_BLACK);
    tft.drawCentreString("Booting", tft.width() / 2, tft.height() / 2, 1);
#else
    tft.begin();
#endif
    begin_storage();
    preferences.begin("lele", false);
    currentPowerMode = (PowerMode) preferences.getUChar("bat_mode", BALANCED);
    begin_tft();
    showBootMenu();
    applyPowerMode();
    init_clock();
    init_led();

    // Some GPIO Settings (such as CYD's brightness control must be set after tft and sdcard)
    _post_setup_gpio();
    // end of post gpio begin

    // #ifndef USE_TFT_eSPI_TOUCH
    // This task keeps running all the time, will never stop
    xTaskCreate(
        taskInputHandler,              // Task function
        "InputHandler",                // Task Name
        INPUT_HANDLER_TASK_STACK_SIZE, // Stack size
        NULL,                          // Task parameters
        2,                             // Task priority (0 to 3), loopTask has priority 2.
        &xHandle                       // Task handle (not used)
    );
    // #endif
#if defined(HAS_SCREEN)
    leleConfig.openThemeFile(leleConfig.themeFS(), leleConfig.themePath, false);
    if (!leleConfig.instantBoot) {
        boot_screen_anim();
        boot_screen_hw(); // Hardware scan + SD Card check
        startup_sound();
    } else {
        // Verifica SD silenciosamente mesmo no instantBoot
        if (setupSdCard()) {
            sdCardReady = true;
            sd_create_structure();
        }
    }
    if (leleConfig.wifiAtStartup) {
        log_i("Loading Wifi at Startup");
        xTaskCreate(
            wifiConnectTask,   // Task function
            "wifiConnectTask", // Task Name
            4096,              // Stack size
            NULL,              // Task parameters
            2,                 // Task priority (0 to 3), loopTask has priority 2.
            NULL               // Task handle (not used)
        );
    }
#endif
    //  start a task to handle serial commands while the webui is running
    startSerialCommandsHandlerTask();

    wakeUpScreen();

    // Initialize Optimization Manager
    optimizationManager.begin();
    PanicMode::getInstance().init();

    // ESP32-S3 specific optimizations
#ifdef CYD_S3
    // Initialize ALL S3 hardware components
    if (!init_all_s3_hardware()) {
        log_w("[S3] Some hardware components failed to initialize");
    }
    
