lelebrr/Esp32-S3/src/main.cpp
    power_gating_init();      // IRF520 MOSFET power control
    thermal_manager_init();   // DS18B20 thermal throttling (240->160MHz)
    s3_perf_init();           // Dynamic clock (240MHz) + battery throttle
    
    #ifdef HAS_GESTURE
    if (paj7620_init(&Wire)) {
        paj7620_enable_interrupt();  // Enable for deep sleep wake
        log_i("[S3] PAJ7620U2 gesture sensor initialized");
    }
    #endif
    
    log_i("[S3] Performance manager @ 240MHz with thermal/battery throttle");
    log_i("[S3] Power gating initialized for %d modules", MODULE_COUNT);
#endif

    // Initialize novos componentes de hardware
    init_new_hardware_pins();
    init_q_table();
    load_q_table_from_sd();

    // Inicializar TTS assíncrono
    xTaskCreate(
        tts_async_task,    // Task function
        "TTS_Async",       // Task Name
        4096,              // Stack size
        NULL,              // Task parameters
        1,                 // Task priority
        NULL               // Task handle
    );

    // Initialize TTS system
    init_tts_main();

    // Initialize AI Attack Learner
    if (!aiLearner.init()) {
        log_w("[AI] Failed to initialize attack learner");
    } else {
        log_i("[AI] Attack learner initialized successfully");
    }

    // Initialize Persistence and Stealth systems
    init_persistence();
    check_stealth_wake();
    init_stealth();

    if (leleConfig.startupApp != "" && !startupApp.startApp(leleConfig.startupApp)) {
        leleConfig.setStartupApp("");
    }
}

/**********************************************************************
 **  Function: loop
 **  Main loop
 **********************************************************************/
#if defined(HAS_SCREEN)
void loop() {
    // Feed the paranoid watchdog
    SecureBoot::loopCheck();

    // Run optimization manager loop
    optimizationManager.loop();
    
    // Panic Mode Check
    PanicMode::getInstance().update();
    if (touchPoint.pressed) {
        PanicMode::getInstance().checkTrigger(touchPoint.x, touchPoint.y);
    }
    if (PanicMode::getInstance().isActive()) {
        lv_timer_handler(); // Ensure LVGL updates for Panic UI
        delay(5);
        return; // BLOCK MAIN MENU
    }

    // Update console interface if active
    updateConsoleInterface();

    // Update IoT interface if active
    updateIoTInterface();

    // Interpreter must be ran in the loop() function, otherwise it breaks
    // called by 'stack canary watchpoint triggered (loopTask)'
#if !defined(LITE_VERSION) && !defined(DISABLE_INTERPRETER)
    if (interpreter_start) {
        TaskHandle_t interpreterTaskHandler = NULL;
        vTaskDelete(serialcmdsTaskHandle); // stop serial commands while in interpreter
        vTaskDelay(pdMS_TO_TICKS(10));
        xTaskCreate(
            interpreterHandler,          // Task function
            "interpreterHandler",        // Task Name
            INTERPRETER_TASK_STACK_SIZE, // Stack size
            NULL,                        // Task parameters
            2,                           // Task priority (0 to 3), loopTask has priority 2.
            &interpreterTaskHandler      // Task handle
        );

        while (interpreter_start == true) { vTaskDelay(pdMS_TO_TICKS(500)); }
        startSerialCommandsHandlerTask();
        interpreter_start = false;
        previousMillis = millis(); // ensure that will not dim screen when get back to menu
    }
#endif
    tft.fillScreen(leleConfig.bgColor);

    // Run periodic stealth tasks
    stealth_periodic_tasks();

    mainMenu.begin();
    delay(1);
}
#else

void loop() {
    tft.setLogging();
    Serial.println(
        "\n"
        "¦¦¦¦¦¦  ¦¦¦¦¦¦  ¦¦    ¦¦  ¦¦¦¦¦¦ ¦¦¦¦¦¦¦ \n"
        "¦¦   ¦¦ ¦¦   ¦¦ ¦¦    ¦¦ ¦¦      ¦¦      \n"
        "¦¦¦¦¦¦  ¦¦¦¦¦¦  ¦¦    ¦¦ ¦¦      ¦¦¦¦¦   \n"
        "¦¦   ¦¦ ¦¦   ¦¦ ¦¦    ¦¦ ¦¦      ¦¦      \n"
        "¦¦¦¦¦¦  ¦¦   ¦¦  ¦¦¦¦¦¦   ¦¦¦¦¦¦ ¦¦¦¦¦¦¦ \n"
        "                                         \n"
        "         PREDATORY FIRMWARE\n\n"
        "Tips: Connect to the WebUI for better experience\n"
        "      Add your network by sending: wifi add ssid password\n\n"
        "At your command:"
    );

    // Enable navigation through webUI
    tft.fillScreen(leleConfig.bgColor);
    mainMenu.begin();
    vTaskDelay(10 / portTICK_PERIOD_MS);
}
#endif
`n// TTS and Deep Sleep variables`nbool speech_pending = false;`nunsigned long last_speech_time = 0;`nbool attack_running = false;`n`n// Initialize TTS system`nvoid init_tts_main() {`n    if (!init_tts_system()) {`n        log_w("[TTS] Failed to initialize TTS system");`n    } else {`n        log_i("[TTS] TTS system initialized successfully");`n        think_and_speak("Sistema pronto. Iniciando monitoramento.");`n    }`n}
